# Consultas em SQL

Esse notebook abarca parte do trabalho prático que solicita a criação de 10 consutlas SQL, contendo descrição textual, comando SQL e resultado.

Tais consultas devem atender aos requisitos mínimos:
* 2 operações de seleção e projeção
* 3 junção de duas relações
* 3 junção de três ou mais relações
* 2 funções de agregação sobre o resultado da junção de pelo menos duas relações

Ademais, o presente Notebook incluirá o item iii das Características avançadas, que especifica:
* iii. mais três consultas do tipo relatório

#### Importação das bibliotecas:

In [1]:
import io
import sqlite3
import pandas as pd

#### Conexão com o banco de dados:

In [2]:
conn = sqlite3.connect('tp2.db')
cursor = conn.cursor()

#### Carga dos dados:
Código comentado pois deve ser executado uma única vez, e já o foi.

In [3]:
#f = io.open('criacao_tabelas.sql', 'r')
#sql = f.read()
#cursor.executescript(sql)

#f = io.open('popula_tabelas.sql', 'r')
#sql = f.read()
#cursor.executescript(sql)

## 10 consultas SQL

#### Consulta 1
Obtém grupo de pelada, data e hora em que uma partida ocorreu.

In [4]:
id_pelada = 9

df01 = pd.read_sql_query("SELECT Grupo_de_pelada.nome, lugar, preco, inicio, fim " +
                         "FROM Pelada NATURAL JOIN Grupo_de_pelada " +
                         "WHERE Pelada.id_pelada = " + str(id_pelada) + " ;", conn)

        
df01

      nome   lugar  preco               inicio                  fim
0  Cerveja  Lugar9    7.0  2019-09-30 20:37:21  2019-09-30 22:36:52

#### Consulta 2
Lista as métricas de todos os jogadores que participaram de uma determinada partida, ordenando alfabeticamente.

In [5]:
id_pelada = 9

df02 = pd.read_sql_query("SELECT nome_pessoa, Pontos, Nota, G, GC " +
                         "FROM Jogador NATURAL JOIN Pessoa " +
                         "WHERE Jogador.id_pelada = " + str(id_pelada) + " " +
                         "ORDER BY nome_pessoa;", conn)

        
df02

  nome_pessoa  Pontos  Nota  G  GC
0   Emanuelly      26  None  1   0
1    Henrique       4  None  3   0
2     Joaquim      29  None  2   1
3       Laura      44  None  2   0
4      Lorena      21  None  1   0
5      Samuel      14  None  2   0
6      Sophia      30  None  3   0

#### Consulta 3
Lista todos os grupos dos quais determinado usuário é administrador.

In [6]:
#pessoa desejada
email = 'helena@gmail.com'

df06 = pd.read_sql_query("SELECT Grupo_de_pelada.nome, Grupo_de_pelada.descricao " +
                         "FROM Pessoa JOIN Grupo_de_Pelada ON Pessoa.id_pessoa = Grupo_de_Pelada.id_adm " +
                         "WHERE Pessoa.email = '" + email + "';", conn)

        
df06

    nome descricao
0  Girls

#### Consulta 4
Lista todas as peladas de um grupo que estão compreendidas em um determinado intervalo de tempo

In [7]:
id_grupo_de_pelada = 1 #grupo desejado
data_inicio = '2019-06-04 00:00:00' #formato AAAA-MM-DD HH:MM:SS
data_fim = '2019-12-30 00:00:00' #formato AAAA-MM-DD HH:MM:SS

df04 = pd.read_sql_query("SELECT lugar, preco, inicio, fim " +
                         "FROM Grupo_de_pelada NATURAL JOIN Pelada " +
                         "WHERE id_grupo_de_pelada = " + str(id_grupo_de_pelada) + " AND " +
                             "(inicio BETWEEN '"+ data_inicio +"' AND '" + data_fim + "' ) " +
                         "ORDER BY inicio;", conn)

        
df04

     lugar  preco               inicio                  fim
0   Lugar5    8.0  2019-06-10 22:42:59  2019-06-11 00:42:30
1  Lugar28    3.0  2019-08-31 02:42:33  2019-08-31 04:42:04
2  Lugar29    9.0  2019-11-27 02:36:38  2019-11-27 04:36:09

#### Consulta 5
Lista todas vaquinhas de um grupo que estão compreendidas em um determinado intervalo de tempo

In [8]:
id_grupo_de_pelada = 1 #grupo desejado
data_inicio = '2019-06-04 00:00:00' #formato AAAA-MM-DD HH:MM:SS
data_fim = '2019-08-30 00:00:00' #formato AAAA-MM-DD HH:MM:SS

df05 = pd.read_sql_query("SELECT motivo, prazo " +
                         "FROM Grupo_de_pelada NATURAL JOIN Vaquinha " +
                         "WHERE id_grupo_de_pelada = " + str(id_grupo_de_pelada) + " AND " +
                             "(prazo BETWEEN '"+ data_inicio +"' AND '" + data_fim + "' ) " +
                         "ORDER BY prazo;", conn)

        
df05

   motivo                prazo
0  camisa  2019-08-11 00:00:00

#### Consulta 6
Lista todos os grupos de pelada a que uma pessoa pertence.

In [9]:
#pessoa desejada
email = 'isabella@gmail.com'

df06 = pd.read_sql_query("SELECT Grupo_de_pelada.nome, Grupo_de_pelada.descricao " +
                         "FROM Pessoa NATURAL JOIN Participa_grupo_pelada NATURAL JOIN Grupo_de_pelada " +
                         "WHERE Pessoa.email = '" + email + "';", conn)

        
df06

      nome descricao
0    Girls
1    Vodka
2  Catuaba

#### Consulta 7
Lista as últimas partidas que o jogador participou, o grupo de pelada em que a partida foi jogada, a data e a hora da partida, e as métricas do jogador na partida em questão, mostrando a mais recentes primeiro. 

Obs: Os dados em questão são fictícios. Por isso exitem resultados com datas futuras. No entanto, uma linha na tabela Jogador só será criada após a partida. Assim, apenas serão retornados valores de jogos que já ocorreram (e não que vão ocorrer, como aconteceu no exemplo abaixo).

In [10]:
#pessoa desejada
email = 'manuela@gmail.com'

df07 = pd.read_sql_query("SELECT Grupo_de_pelada.nome, Pelada.lugar, Pelada.preco, Pelada.inicio, Pontos, Nota, G, GC " +
                         "FROM Pessoa NATURAL JOIN Jogador NATURAL JOIN Pelada NATURAL JOIN Grupo_de_pelada " +
                         "WHERE Pessoa.email = '" + email + "'"+
                         "ORDER BY inicio desc;", conn)

        
df07

    nome    lugar  preco               inicio  Pontos  Nota  G  GC
0  Vodka  Lugar10    8.0  2020-04-16 08:12:47      13  None  0   0
1  Girls   Lugar5    8.0  2019-06-10 22:42:59      43  None  3   0
2  Mista  Lugar11    8.0  2019-04-27 20:13:45      26  None  2   0
3  Girls  Lugar12    4.0  2019-04-17 03:12:18       5  None  1   0
4  Vodka  Lugar25   14.0  2019-03-27 04:34:46       4  None  0   0
5  Vodka   Lugar4    5.0  2018-09-09 17:47:10      47  None  0   0

#### Consulta 9
Lista as peladas das quais determinado jogador participou, em ordem decrescente do número total de gols feitos na partida.

In [11]:
email = 'manuela@gmail.com'

df09 = pd.read_sql_query("SELECT Grupo_de_Pelada.nome, lugar, inicio, sum(G) as Gols_na_partida  " +
                         "FROM Jogador NATURAL JOIN Pelada NATURAL JOIN Grupo_de_Pelada " +
                         "WHERE id_pelada in (SELECT id_pelada FROM Jogador NATURAL JOIN Pessoa WHERE email = '" + email + "') " +
                         "GROUP BY id_pelada " +
                         "ORDER BY Gols_na_partida desc;", conn)

df09

    nome    lugar               inicio  Gols_na_partida
0  Mista  Lugar11  2019-04-27 20:13:45               10
1  Girls  Lugar12  2019-04-17 03:12:18               10
2  Vodka   Lugar4  2018-09-09 17:47:10                7
3  Girls   Lugar5  2019-06-10 22:42:59                7
4  Vodka  Lugar10  2020-04-16 08:12:47                4
5  Vodka  Lugar25  2019-03-27 04:34:46                3

#### Consulta 10
Contabiliza o total já arrecadado em uma vaquinha coletiva.